{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "TCN", "config": {"name": "tcn", "trainable": true, "batch_input_shape": [null, 6, 5], "dtype": "float32", "nb_filters": 12, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": false, "dropout_rate": 0.0, "return_sequences": false, "activation": "elu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 20, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 6, 5]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}